eisup_2019_docmng_integration/src/Documents/Опрос/Опрос.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Опрос</name>
  <basedOn>Catalog.ТиповыеАнкеты</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>ОпрашиваемоеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.ЗаявкиКандидатов</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТиповаяАнкета</name>
    <type>
      <types>CatalogRef.ТиповыеАнкеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассылка</name>
    <type>
      <types>DocumentRef.РассылкаАнкет</types>
    </type>
  </attributes>
  <attributes>
    <name>ОпросЗавершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Вопросы</name>
    <attributes>
      <name>Вопрос</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТиповойОтвет</name>
      <type>
        <types>Characteristic.ВопросыДляАнкетирования</types>
      </type>
    </attributes>
    <attributes>
      <name>СекундОтвета</name>
      <comment>Количество затраченных секунд на ответ</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Раздел</name>
      <type>
        <types>CatalogRef.РазделыАнкеты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставнойОтвет</name>
    <attributes>
      <name>ВопросВладелец</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</types>
      </type>
    </attributes>
    <attributes>
      <name>Вопрос</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТиповойОтвет</name>
      <type>
        <types>Characteristic.ВопросыДляАнкетирования</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиВТаблице</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/CommonModules/ЗаявкиКандидатовДополнительный/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Вспомогательные процедуры, функции

////////////////////////////////////////////////////////////////////////////////
// Процедуры, функции объекта

////////////////////////////////////////////////////////////////////////////////
// Процедуры, функции для работы формы документа

#Если Клиент Тогда

Процедура ВыполнитьОформлениеСтрокиДополнительно(ОформлениеСтроки) Экспорт 
	
	Если ТипЗнч(ОформлениеСтроки.ДанныеСтроки.Ссылка) = Тип("ДокументСсылка.Опрос") Тогда
		ОформлениеСтроки.Ячейки.ВидДокумента.Картинка = БиблиотекаКартинок.СвойстваОбъектов;
		ОформлениеСтроки.Ячейки.ДатаКонтакта.Текст = ОформлениеСтроки.ДанныеСтроки.Дата;
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьЗаголовокКнопкиРезюме(Форма) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено

КонецПроцедуры

Процедура ОбработкаОповещенияДополнительно(Форма, ИмяСобытия, Параметр, Источник) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры

Процедура ДополнитьСтруктуруДляСпискаДополнительныхФайлов(Форма, СтруктураДляСпискаДополнительныхФайлов) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры

Процедура ОткрытьРезюмеНажатие(Форма) Экспорт
	
	ТиповаяАнкета = Неопределено;
	Ссылка = Форма.Ссылка;
	
	Опрос = ПроцедурыУправленияПерсоналомПереопределяемый.НайтиРезюмеКандидата(Ссылка, ТиповаяАнкета);
	
	Если ТиповаяАнкета = Неопределено Тогда
		Предупреждение("Не указана анкета, которая используется в качестве резюме. Необходимо указать анкету в ""Настройках параметров учета""!");
		Возврат;
	КонецЕсли;
	
	Если Опрос = Неопределено Тогда
		ФормаОпроса = Документы.Опрос.ПолучитьФормуНовогоДокумента();
		ФормаОпроса.ОпрашиваемоеЛицо	= Ссылка;
		ФормаОпроса.ТиповаяАнкета		= ТиповаяАнкета;
		ФормаОпроса.ЗаполнитьВопросыАнкеты(ТиповаяАнкета);
		
	Иначе
		ФормаОпроса = Опрос.ПолучитьФорму();
		
	КонецЕсли;
	
	ФормаОпроса.мФормаОткрытаИзЗаявкиКандидата = Истина;
	ФормаОпроса.Открыть();

КонецПроцедуры

#КонецЕсли
